In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name' : 'Jone', 'age': 15, 'job': 'student'},
    {'name' : 'Janny', 'age': 10, 'job': 'developer'},
    {'name' : 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])

In [3]:
df.head()

    name  age        job
0   Jone   15    student
1  Janny   10  developer
2   Nate   30    teacher

In [4]:
# salary라는 새로운 열 삽입
df['salary'] = 0

In [5]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Janny   10  developer       0
2   Nate   30    teacher       0

In [6]:
import numpy as np

In [7]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [8]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Janny   10  developer    yes
2   Nate   30    teacher    yes

In [9]:
friend_dict_list = [
    {'name' : 'Jone', 'midterm': 95, 'final':85},
    {'name' : 'Janny', 'midterm': 85, 'final':80},
    {'name' : 'Nate', 'midterm': 30, 'final':10}
]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [10]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Janny       85     80
2   Nate       30     10

In [11]:
# 총점을 추가
df['total'] = df['midterm'] + df['final']

In [12]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Janny       85     80    165
2   Nate       30     10     40

In [15]:
df['average'] = df['total']/2

In [16]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Janny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [17]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [18]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Janny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [19]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [20]:
df.grade = df.grade.apply(pass_or_fail)

In [21]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Janny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [22]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [23]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [24]:
def extract_year(row):
    return row.split('-')[0]

In [25]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [26]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [27]:
friend_dict_list = [
    {'name' : 'Jone', 'midterm': 95, 'final':85},
    {'name' : 'Janny', 'midterm': 85, 'final':80},
    {'name' : 'Nate', 'midterm': 30, 'final':10}
]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [28]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Janny       85     80
2   Nate       30     10

In [31]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])

In [32]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [33]:
# 데이터 프레임 합치기
df.append(df2, ignore_index = True)

    name  midterm  final
0   Jone       95     85
1  Janny       85     80
2   Nate       30     10
3    Ben       50     50